// module.exports = {
//     year: async (history, args, { models }) => {
//         return await models.History.find();
//     },
//     content: async(history, args, {models}) =>{
//         return await models.History.find({})
//     },
//     source:
// };
/* 

    {
      "date": "1011-01-01",
      "content": "[음력]거란군이 개경에 들어가 태묘, 궁궐 등을 불태움",
      "source": "고려사"
      
    },
    {
      "date": "1018-01-01",
      "content": "[음력]서경에 사신을 파견하여 태조의 제사를 지냄",
      "source": "고려사"
      
    },
    {
      "date": "1116-01-01",
      "content": "[음력]발해의 땅 동경에서 고영창이 반란을 일으킴",
      "source": "중국사서"
      
    },
    {
      "date": "1281-01-01",
      "content": "[음력]원에서 왕통을 보내 조서를 내리고 수시력을 반포함",
      "source": "고려사"
      
    },
    {
      "date": "1357-01-01",
      "content": "[음력]신년하례연을 중지시키고 종실·관리 등에게 융복 차림으로 입시하게 함",
      "source": "고려사"
      
    },
    {
      "date": "1362-01-01",
      "content": "[음력]복주에서 신년을 하례함",
      "source": "고려사"
      
    },
    {
      "date": "1364-01-01",
      "content": "[음력]최유가 덕흥군을 받들고 압록강을 건너 진격해옴",
      "source": "고려사"
      
    },
    {
      "date": "1399-01-01",
      "content": "[음력]명나라의 건문 연호를 사용함",
      "source": "조선왕조실록"
      
    },
    {
      "date": "1425-01-01",
      "content": "[음력]전 참찬 김여지 죽음",
      "source": "조선왕조실록"
      
    },
    {
      "date": "1431-01-01",
      "content": "[음력]새해에 신하들이 인사를 올리는 의례에서 새로 만든 아악을 사용함",
      "source": "조선왕조실록"
      
    },
    {
      "date": "1489-01-01",
      "content": "[음력]정조(正朝, 설날)의 하례를 정지함",
      "source": "조선왕조실록"
      
    },
    {
      "date": "1495-01-01",
      "content": "[음력]성종의 반영정(半影幀)을 그리게 함",
      "source": "조선왕조실록"
      
    },
    {
      "date": "1520-01-01",
      "content": "[음력]정조(正朝)의 회례연을 정지함",
      "source": "조선왕조실록"
      
    },
    {
      "date": "1569-01-01",
      "content": "[음력]이황이 원묘(原廟) 제도를 일부 개정하자고 주장하였으나 받아들이지 않음",
      "source": "조선왕조실록"
      
    },
    {
      "date": "1586-01-01",
      "content": "[음력]도호부에 향교 제독관을 신설하여 학식 있는 자를 선발하게 함",
      "source": "조선왕조실록"
      
    },
    {
      "date": "1595-01-01",
      "content": "[음력]명나라가 일본군을 달래어 철수하도록 재촉함",
      "source": "조선왕조실록"
      
    },
    {
      "date": "1598-01-01",
      "content": "[음력]조명 연합군이 울산 도산성을 공격하여 토굴 속으로 달아난 가등청정을 포위함",
      "source": "조선왕조실록"
      
    },
    {
      "date": "1599-01-01",
      "content": "[음력]한응인을 명나라에 사은사로 보냄",
      "source": "조선왕조실록"
      
    },
    {
      "date": "1601-01-01",
      "content": "[음력]임진왜란 이후 처음으로 백관에게 녹봉을 줌",
      "source": "조선왕조실록"
      
    },
    {
      "date": "1638-01-01",
      "content": "[음력]문서 대부분에 청의 연호를 사용하고 제향의 축사에는 명의 연호를 사용함",
      "source": "조선왕조실록"
      
    },
    {
      "date": "1671-01-01",
      "content": "[음력]관리와 사대부에게 흑색 옷을 입게 함",
      "source": "조선왕조실록"
      
    },
    {
      "date": "1716-01-01",
      "content": "[음력]재해가 심한 제주도에 진휼 곡식을 더 보내게 함",
      "source": "조선왕조실록"
      
    },
    {
      "date": "1734-01-01",
      "content": "[음력]농사를 권장하기 위해 《농가집성(農家集成)》을 인쇄하여 반포하게 함",
      "source": "조선왕조실록"
      
    },
    {
      "date": "1753-01-01",
      "content": "[음력]공물 아문의 폐단과 군병의 재능을 시험하는 것에 관해 하교함",
      "source": "조선왕조실록"
      
    },
    {
      "date": "1757-01-01",
      "content": "[음력]혼기를 놓친 사대부·서인들을 돌보아 혼인하도록 도와주게 함",
      "source": "조선왕조실록"
      
    },
    {
      "date": "1765-01-01",
      "content": "[음력]정조(正朝)의 하례를 정지함",
      "source": "조선왕조실록"
      
    },
    {
      "date": "1800-01-01",
      "content": "[음력]원자(순조)를 왕세자로 삼음",
      "source": "조선왕조실록"
      
    },
    {
      "date": "1803-01-01",
      "content": "[음력]《선원보략(璿源譜略》의 증수를 완성함",
      "source": "조선왕조실록"
      
    },
    {
      "date": "1847-01-01",
      "content": "[음력]정월 초하룻날 의례를 거행하며 공납업자와 상인의 요역을 탕감하여 줌",
      "source": "조선왕조실록"
      
    },
    {
      "date": "1888-01-01",
      "content": "[음력]각 조약국과 협의 중이던 세관 가규칙(稅關假規則)에 합의하여 실시",
      "source": "근대사 연표"
      
    },
    {
      "date": "1897-01-01",
      "content": "서울 시내에 최초의 가로등(석유) 등장",
      "source": "근대사 연표"
      
    },
    {
      "date": "1900-01-01",
      "content": "만국 우편 연맹에 가입하여 외국과 직접 우편물 교환",
      "source": "근대사 연표"
      
    },
    {
      "date": "1907-01-01",
      "content": "의병장 최익현(崔益鉉, 1833~1907), 대마도에서 단식 투쟁하다 사망함",
      "source": "근대사 연표"
      
    },
    {
      "date": "1908-01-01",
      "content": "재판소 구성법·시행법 및 설치법 시행 공포. 4급 3심 제도 채택",
      "source": "근대사 연표"
      
    },
    {
      "date": "1910-01-01",
      "content": "통감부, 대한제국에서 발행한 구 백동화의 통용 금지",
      "source": "근대사 연표"
      
    },
    {
      "date": "1911-01-01",
      "content": "경무 총감부,  안명근(安明根) 체포를 계기로 황해도 일대의 민족주의자 총검거 시작(안악 사건, 105인 사건)",
      "source": "근대사 연표"
      
    },
    {
      "date": "1912-01-01",
      "content": "한국 표준시, 일본 표준시에 맞춰 오전 11시 30분(127도 30분)을 정오(135도)로 변경",
      "source": "근대사 연표"
      
    },
    {
      "date": "1917-01-01",
      "content": "이광수의 장편 소설 「무정(無情)」, 〈매일신보〉에 연재 시작",
      "source": "근대사 연표"
      
    },
    {
      "date": "1923-01-01",
      "content": "경성 남대문역, 경성역으로 개칭",
      "source": "근대사 연표"
      
    },
    {
      "date": "1949-01-01",
      "content": "미국 정부, 대한민국 정부를 정식 승인",
      "source": "대한민국사 연표"
      
    },
    {
      "date": "1957-01-01",
      "content": "전국적으로 치안관의 치안 재판(즉결 재판) 폐지하고, 법관의 순회 재판 실시",
      "source": "대한민국사 연표"
      
    },
    {
      "date": "1962-01-01",
      "content": "공용 연호를 단기(檀紀)에서 서기(西紀)로 변경",
      "source": "대한민국사 연표"
      
    },
    {
      "date": "1963-01-01",
      "content": "국가 재건 최고 회의, 1년 7개월 만에 민간인 정치 활동 재개 허용",
      "source": "대한민국사 연표"
      
    },
    {
      "date": "1964-01-01",
      "content": "계량 합리화 방안으로 ‘미터법’ 실시하여 미터·리터·그램 단위를 사용하고, 척관법(尺貫法) 사용 때에는 벌금 부과",
      "source": "대한민국사 연표"
      
    },
    {
      "date": "1979-01-01",
      "content": "경제 기획원, 한국인 평균 수명이 여자 70세, 남자 66.1세라고 발표",
      "source": "대한민국사 연표"
      
    },
    {
      "date": "1989-01-01",
      "content": "국민 해외 여행 전면 자유화 실시로 관광 여권의 발급 제한 완전 철폐",
      "source": "대한민국사 연표"
      
    },
    {
      "date": "2006-01-01",
      "content": "대통령 직속, 「군의문사 진상 규명 위원회」 설립(~2009.12)",
      "source": "대한민국사 연표"
    }


*/